Reports/ОтчетПоПрогульщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетПоПрогульщикам</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ТабельРаботыПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТабельРаботыПродавцов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отсутствие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтсутствия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвойствоПродавца</Name>
					<Comment>0 - Полный, 1 - Частичный, 2 - Старший продавец, 3 - Практикант, 4 - Стажер, 5 - Ночной почасовик, 6 - Старший ночной почасовик</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Comment>Время работы почасовика (в часах), используется для магазинов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тренинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тренинги</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭкстренныйВызов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГруппаСотрудника</Name>
					<Comment>ЦФО к которому привязан сотрудник через Помощника ТУ/ТУ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаФизическогоЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРаботыОснПродавцом</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияАнализовПоМедКнижке</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Промоутер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорпоративнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КорпоративныеБанковскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнештатныйСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьВнештатника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиВнештатныхСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОДнеРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитСкладу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяИнициаторомЗаявокНаРасходДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентБонусаПомощникаУправляющего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УинВЗуп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Информация для помошника управляющего (Откуда сотрудник будет ехать на подработку)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомощникТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КабинетРассылкиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РоумингТолькоСвоиЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияПсихологОсв</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникТилси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуперпользовательТехбота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободноЗанятый</Name>
					<Comment>Признак назначается физ. лицам, с неполной занятостью (студентам пр.) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВахтыВГрафике</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВахтГрафикиРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПройденныеТренинги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тренинг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Тренинги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрохождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТренингПройден</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетПоПрогульщикам/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	СтрокаПодключения = ПолныеПрава.ПолучитьСтрокуПодключения_Зуп();
	
	v82COMОбъект = Новый COMОбъект(ПолныеПрава.ПолучитьВерсиюКомОбъекта_Зуп() + ".COMConnector");
	Попытка
		v82 = v82COMОбъект.Connect(СтрокаПодключения);
		ПодключениеУстановлено=Истина;
	Исключение
		ПодключениеУстановлено=Ложь;
		Сообщить("Не удалось подключитьс к базе ЗУП");
		Возврат;
	КонецПопытки;
	
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	РаботникиОрганизацийСрезПоследних.Период КАК ДатаУвольнения,
	//|	РаботникиОрганизацийСрезПоследних.Регистратор.Номер КАК НомерПриказа,
	//|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо.Код КАК КодФизЛица
	//|ИЗ
	//|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
	//|ГДЕ
	//|	РаботникиОрганизацийСрезПоследних.Должность.Наименование = ""Продавец-консультант""
	//|	И РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	КодФизЛица";
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	МАКСИМУМ(РаботникиОрганизацийСрезПоследних.Период) КАК ДатаУвольнения,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	|ПОМЕСТИТЬ МаксимальныеДатыУвольнений
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Должность.Наименование = ""Продавец-консультант""
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(РаботникиОрганизацийСрезПоследних.Период) КАК ДатаПриема,
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	|ПОМЕСТИТЬ МаксимальныеДатыПриемов
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)) КАК РаботникиОрганизацийСрезПоследних
	|ГДЕ
	|	РаботникиОрганизацийСрезПоследних.Должность.Наименование = ""Продавец-консультант""
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаксимальныеДатыУвольнений.ДатаУвольнения,
	|	РаботникиОрганизацийСрезПоследних.Регистратор.Номер КАК НомерПриказа,
	|	МаксимальныеДатыУвольнений.СотрудникФизлицо.Код КАК КодФизЛица
	|ИЗ
	|	МаксимальныеДатыУвольнений КАК МаксимальныеДатыУвольнений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)) КАК РаботникиОрганизацийСрезПоследних
	|		ПО МаксимальныеДатыУвольнений.СотрудникФизлицо = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	|			И МаксимальныеДатыУвольнений.ДатаУвольнения = РаботникиОрганизацийСрезПоследних.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ МаксимальныеДатыПриемов КАК МаксимальныеДатыПриемов
	|		ПО МаксимальныеДатыУвольнений.СотрудникФизлицо = МаксимальныеДатыПриемов.СотрудникФизлицо
	|ГДЕ
	|	ЕСТЬNULL(МаксимальныеДатыПриемов.ДатаПриема, ДАТАВРЕМЯ(1, 1, 1)) <= МаксимальныеДатыУвольнений.ДатаУвольнения
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодФизЛица";
	
	//
	Настройки=КомпоновщикНастроек.ПолучитьНастройки();
	Период = Настройки.ПараметрыДанных.Элементы.Найти("Период");
	
	//
	Запрос=v82.NewObject("Запрос");  
	Запрос.текст = ТекстЗапроса;			 
	Запрос.УстановитьПараметр("Период", Период.Значение.Дата);  
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТЗЗУП = Новый ТаблицаЗначений;
	ТЗЗУП.Колонки.Добавить("ДатаУвольнения", Новый ОписаниеТипов("Дата"));
	ТЗЗУП.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	ТЗЗУП.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	
	Пока Выборка.следующий() Цикл
		НС=ТЗЗУП.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Выборка);
		НС.ФизЛицо=Справочники.ФизическиеЛица.НайтиПоКоду(Выборка.КодФизЛица);
	КонецЦикла;	
	
	ТЗЗУП.Сортировать("ФизЛицо, ДатаУвольнения");
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеЗУП.ДатаУвольнения,
	|	ДанныеЗУП.НомерПриказа,
	|	ДанныеЗУП.ФизЛицо
	|ПОМЕСТИТЬ ВсеУвольнения
	|ИЗ
	|	&ДанныеЗУП КАК ДанныеЗУП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабельРаботыПродавцов.Сотрудник,
	|	МАКСИМУМ(ТабельРаботыПродавцов.Период) КАК ПоследняяДатаВыхода,
	|	МАКСИМУМ(ТабельРаботыПродавцов.Сотрудник.Активный) КАК Активный
	|ПОМЕСТИТЬ ВсеВыходы
	|ИЗ
	|	РегистрСведений.ТабельРаботыПродавцов КАК ТабельРаботыПродавцов
	|ГДЕ
	|	ТабельРаботыПродавцов.Отсутствие = ЗНАЧЕНИЕ(Перечисление.ВидыОтсутствия.ПустаяСсылка)
	|	И ТабельРаботыПродавцов.Сотрудник.Должность = ""Продавец-консультант""
	|	И НЕ ТабельРаботыПродавцов.Сотрудник.ПометкаУдаления
	|	И ТабельРаботыПродавцов.Период < &Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабельРаботыПродавцов.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеВыходы.Сотрудник,
	|	ВсеВыходы.ПоследняяДатаВыхода КАК ПоследняяДатаВыхода,
	|	ВсеВыходы.Активный,
	|	МИНИМУМ(ВсеУвольнения.ДатаУвольнения) КАК ДатаУвольнения
	|ПОМЕСТИТЬ Основная
	|ИЗ
	|	ВсеВыходы КАК ВсеВыходы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеУвольнения КАК ВсеУвольнения
	|		ПО ВсеВыходы.Сотрудник = ВсеУвольнения.ФизЛицо
	|			И ВсеВыходы.ПоследняяДатаВыхода <= ВсеУвольнения.ДатаУвольнения
	|ГДЕ
	|	ВсеВыходы.ПоследняяДатаВыхода < ДОБАВИТЬКДАТЕ(&Период, МЕСЯЦ, -1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеВыходы.Сотрудник,
	|	ВсеВыходы.ПоследняяДатаВыхода,
	|	ВсеВыходы.Активный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Основная.Сотрудник,
	|	Основная.ПоследняяДатаВыхода,
	|	Основная.Активный,
	|	Основная.ДатаУвольнения,
	|	ВсеУвольнения.НомерПриказа,
	|	ТабельРаботыПродавцов.Группа
	|ИЗ
	|	Основная КАК Основная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВсеУвольнения КАК ВсеУвольнения
	|		ПО Основная.Сотрудник = ВсеУвольнения.ФизЛицо
	|			И Основная.ДатаУвольнения = ВсеУвольнения.ДатаУвольнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТабельРаботыПродавцов КАК ТабельРаботыПродавцов
	|		ПО Основная.Сотрудник = ТабельРаботыПродавцов.Сотрудник
	|			И Основная.ПоследняяДатаВыхода = ТабельРаботыПродавцов.Период";
	
	//ТекстЗапроса =
	//"ВЫБРАТЬ
	//|	ТабельРаботыПродавцов.Сотрудник,
	//|	МАКСИМУМ(ТабельРаботыПродавцов.Период) КАК ПоследняяДатаВыхода,
	//|	МАКСИМУМ(ТабельРаботыПродавцов.Сотрудник.Активный) КАК Активный
	//|ПОМЕСТИТЬ ВсеВыходы
	//|ИЗ
	//|	РегистрСведений.ТабельРаботыПродавцов КАК ТабельРаботыПродавцов
	//|ГДЕ
	//|	ТабельРаботыПродавцов.Отсутствие = ЗНАЧЕНИЕ(Перечисление.ВидыОтсутствия.ПустаяСсылка)
	//|	И ТабельРаботыПродавцов.Сотрудник.Должность = ""Продавец-консультант""
	//|	И НЕ ТабельРаботыПродавцов.Сотрудник.ПометкаУдаления
	//|{ГДЕ
	//|	(ТабельРаботыПродавцов.Период < &Период)}
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТабельРаботыПродавцов.Сотрудник
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВсеВыходы.Сотрудник,
	//|	ВсеВыходы.ПоследняяДатаВыхода КАК ПоследняяДатаВыхода,
	//|	ВсеВыходы.Активный
	//|ИЗ
	//|	ВсеВыходы КАК ВсеВыходы";
	
	Запрос=Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Период",Период.Значение.Дата);
	Запрос.УстановитьПараметр("ДанныеЗУП",ТЗЗУП);
	
	ДанныеФинансов = Запрос.Выполнить().Выгрузить();
	//ДанныеФинансов.Колонки.Добавить("ДатаУвольнения", Новый ОписаниеТипов("Дата"));
	//ДанныеФинансов.Колонки.Добавить("НомерПриказа", Новый ОписаниеТипов("Строка"));
	//
	//Для Каждого Стр Из ДанныеФинансов Цикл
	//	
	//	СтруктураПоиска = Новый Структура();
	//	СтруктураПоиска.Вставить("ФизЛицо", Стр.Сотрудник);
	//	
	//	НайденныеСтроки = ТЗЗУП.НайтиСтроки(СтруктураПоиска);
	//	Если НайденныеСтроки.Количество()Тогда
	//		
	//		НомерПриказа = "";
	//		ДатаУвольнения = Дата(1,1,1);
	//		
	//		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
	//			
	//			Если Стр.ПоследняяДатаВыхода <= НайденнаяСтрока.ДатаУвольнения Тогда
	//				НомерПриказа = НайденнаяСтрока.НомерПриказа;
	//				ДатаУвольнения = НайденнаяСтрока.ДатаУвольнения;
	//				Прервать;	
	//			КонецЕсли; 
	//			
	//		КонецЦикла;
	//		
	//		Стр.НомерПриказа = НомерПриказа;
	//		Стр.ДатаУвольнения = ДатаУвольнения;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	//
	ВнешниеНаборыДанных = Новый Структура; 
	ВнешниеНаборыДанных.Вставить("ДанныеФинансов", ДанныеФинансов); 
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных1");
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);
	
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры
